{
  "title": "",
  "url": "https://migrationology.com/foodie-alert-tasty-1-chinese-lunch-special/",
  "content": "Lunch in China is a big meal (and a big deal), and for myself, it’s probably my favorite meal of the day.\n\nWhile in Yangshuo, there were a number of options for lunch, one of them being a huge assortment of pre-cooked dishes all set up buffet fast food style on a table – you then either help yourself or the vendor spoons food onto your plate.\n\nThis method of serving food is common throughout Asia. One of my favorite restaurants in Bangkok serves southern Thai food this way, and in Malaysia and Indonesia their nasi campur is served in a similar fashion.\n\nFor only 8 RMB ($1.26), I got 3 – 4 items from the Chinese buffet piled onto a single plate, a bowl of light chicken broth soup, and the all-important self service all you can eat rice (one of my favorite things about China and one of the best ideas in the world).\n\nIt was a toss up, somedays I would dine on $1 bowls of Guilin rice noodles, but many days I just couldn’t get over the fact that China included self service all you can eat rice!\n\nThe range of pre-cooked dishes was outstanding, and there were so many choices it was difficult to narrow in on just 3 – 4.\n\nThese little chunks of tofu stuffed with minced pork, garlic, onions and a few spices were one bite wonders!\n\nOne of the things I love about Chinese dishes is that while they do include meat, they often also includes huge amounts of fresh vegetables. I think Chinese eat basically every known vegetable on earth!\n\nThe plate above included some kind of green leafy vegetables, steamed lotus root, and soft fried tofu.\n\nAnother favorite of mine was the minced pork stuffed bitter melon gourd.\n\nBitterness is the most neglected taste in Western cuisine, but the Chinese have mastered a couple of dishes that take bitterness to the next level of delight!\n\nThe last plate of the day included stir fried pumpkin, stir fried jicama and stir fried peppers.\n\nAll these tasty Chinese foods sloppily combined onto a plate and served with as much rice as I could eat – that’s my kind of a $1 Chinese lunch special!\n\n",
  "images": [
    {
      "url": "http://farm8.staticflickr.com/7005/6536499759_a605f0ab22_o.jpg",
      "file": "1737096961621-6536499759_a605f0ab22_o.jpg"
    },
    {
      "url": "http://farm8.staticflickr.com/7165/6536500173_cdd2355976_o.jpg",
      "file": "1737096963945-6536500173_cdd2355976_o.jpg"
    },
    {
      "url": "http://farm8.staticflickr.com/7150/6536495841_d4457cfb50_o.jpg",
      "file": "1737096965473-6536495841_d4457cfb50_o.jpg"
    },
    {
      "url": "http://farm8.staticflickr.com/7155/6536498765_a986d0aa99_o.jpg",
      "file": "1737096967881-6536498765_a986d0aa99_o.jpg"
    },
    {
      "url": "http://farm8.staticflickr.com/7156/6536496525_e8573b0604_o.jpg",
      "file": "1737096971198-6536496525_e8573b0604_o.jpg"
    },
    {
      "url": "http://farm8.staticflickr.com/7164/6536497455_12a28e0d13_o.jpg",
      "file": "1737096973567-6536497455_12a28e0d13_o.jpg"
    }
  ]
}